/* Задача 10: Напишите программу, которая принимает на вход 
трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1 */

int ExOne (int num)
{
    
}


/* Задача 13: Напишите программу, которая выводит третью 
цифру заданного числа или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6 */

/* Задача 15: Напишите программу, которая принимает 
на вход цифру, обозначающую день недели, и проверяет,
является ли этот день выходным.
6 -> да
7 -> да
1 -> нет */

/* задача необязательная.
"В институте биоинформатики по офису передвигается робот. 
Недавно студенты из группы программистов написали для него программу,
по которой робот, когда заходит в комнату, считает количество
программистов в ней и произносит его вслух: "n программистов".
Для того, чтобы это звучало правильно, для каждого n нужно
использовать верное окончание слова.
Напишите программу, считывающую с пользовательского ввода целое
число n (неотрицательное), выводящее это число в консоль вместе
с правильным образом изменённым словом "программист", для того,
чтобы робот мог нормально общаться с людьми,
например: 1 программист, 2 программиста, 5 программистов.
В комнате может быть очень много программистов.
Проверьте, что ваша программа правильно обработает
все случаи, как минимум до 1000 человек." */