/* Console.Write("введите ваше имя ");
        string name = Console.ReadLine();
 
        switch (name)
            {
            case "Bob":
                Console.WriteLine("Здарова, Bob");
                break;
            case "Tom":
                Console.WriteLine("Привет, Tom");
                break;
            case "Sam":
                Console.WriteLine("Как дела, Sam");
                break;
            default:
                Console.WriteLine("Приятно познакомиться, "+name);
                break;
            }
           */

/* Напишите программу, которая принимает 
на вход число (А) и выдаёт сумму чисел от 1 до А.
7 -> 28
4 -> 10
8 -> 36
 */

int [] arr = {5,6,7,32,65,312,5,2,5};
foreach (int i in arr) Console.WriteLine($"{i}, ");
Console.WriteLine();