void ExSix() // Сгенерировать массив случайных целых чисел размерностью m*n (размерность вводим с клавиатуры).
             // Вывести на экран красивенько таблицей. Перемешать случайным образом элементы массива,
             // причем чтобы каждый гарантированно переместился на другое место (возможно для этого
             // удобно будет использование множества) и выполнить это за m*n / 2 итераций. То есть
             // если массив три на четыре, то надо выполнить не более 6 итераций. И далее в конце
             // опять вывести на экран как таблицу.",
{

}
void ExSeven() // Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
               // При этом пользователь не задает сколько чисел он введет (то есть число M), а подсчет количества
               // чисел производится после того, как пользователь не ввел информацию и нажал Enter."
{

}